# 1.  Визначити, чи є введене число додатним, від’ємним або нулем.
a = int(input("numb: "))
print("введене число є ", end="")
if a > 0: print("додатним")
elif a < 0: print("від’ємним")
else: print("нулем")

print("")

# 2.  Користувач вводить вік. Якщо більше або рівно 18 — "Дозволено", інакше — "Заборонено"
print ("Дозволено" if int(input("age: ")) >= 18 else "Заборонено")

print("")

# 3.  Визначити більше число серед двох введених
m = int(input("numb 1: "))
n = int(input("numb 2: "))
print ("bigger: ", m if m > n else n)