# Задача 1
# З клавіатури задано кількість елементів масиву N та значення
# кожного елемента (масив складається з цілих чисел). Вивести значення
# найменшого елементу масиву та кількість таких елементів.

n = int(input("Введіть кількість елементів масиву N: "))
arr = []
for i in range(n):
    arr.append(int(input(f"Введіть значення {i+1} елемента масиву: ")))
print("Найменший елемент масиву:", min(arr))
print("Кількість таких елементів:", arr.count(min(arr)))

print("________________________________________________\n")

# Задача 2
# З клавіатури задано кількість елементів масиву N та значення
# кожного елемента (масив складається з цілих чисел). Вивести значення
# найменшого елементу масиву та індекс першого найменшого елемента. 

n = int(input("Введіть кількість елементів масиву N: "))
arr = []
for i in range(n):
    arr.append(int(input(f"Введіть значення {i+1} елемента масиву: ")))
print("Найменший елемент масиву:", min(arr))
print("Індекс першого найменшого елемента:", arr.index(min(arr)))

print("________________________________________________\n")

# Задача 3 
# З клавіатури задано кількість елементів масиву N та значення
# кожного елемента (масив складається з цілих чисел). Вивести значення
# локальних мінімумів в рядок через пробіл. Локальним мінімумом називається
# елемент менший за своїх сусідів.

n = int(input("Введіть кількість елементів масиву N: "))
arr = []
for i in range(n):
    arr.append(int(input(f"Введіть значення {i+1} елемента масиву: ")))
for i in range(1, n - 1):
    if arr[i] < arr[i - 1] and arr[i] < arr[i + 1]:
        print(arr[i], end=" ")
        
print("________________________________________________\n")
        
# Задача 4 
# З клавіатури задано кількість елементів масиву N та значення
# кожного елемента (масив складається з цілих чисел). Вивести значення
# першого кратного 3 елементу масиву.

n = int(input("Введіть кількість елементів масиву N: "))
arr = []
for i in range(n):
    arr.append(int(input(f"Введіть значення {i+1} елемента масиву: ")))
for i in range(n):
    if arr[i] % 3 == 0:
        print(arr[i])
        break

print("________________________________________________\n")

# Задача 5 
# З клавіатури задано кількість елементів масиву N та значення
# кожного елемента (масив складається з цілих чисел). Вивести значення
# останнього додатного елементу масиву.

n = int(input("Введіть кількість елементів масиву N: "))
arr = []
for i in range(n):
    arr.append(int(input(f"Введіть значення {i+1} елемента масиву: ")))
for i in range(n - 1, -1, -1):
    if arr[i] > 0:
        print(arr[i])
        break

print("________________________________________________\n")

# Задача 6 
# З клавіатури задано кількість елементів масиву N та значення
# кожного елемента (масив складається з цілих чисел). Вивести значення
# останнього додатного елементу масиву.

n = int(input("Введіть кількість елементів масиву N: "))
arr = []
for i in range(n):
    arr.append(int(input(f"Введіть значення {i+1} елемента масиву: ")))
for i in range(n - 1, -1, -1):
    if arr[i] > 0:
        print(arr[i])
        break

print("________________________________________________\n")

# Задача 7 
# З клавіатури задано кількість елементів масиву N та значення
# кожного елемента (масив складається з цілих чисел). Знайти суму індексів
# елементів, значення яких є простими числами. (Просте число — це
# натуральне число, яке має рівно два

n = int(input("Введіть кількість елементів масиву N: "))
arr = []
for i in range(n):
    arr.append(int(input(f"Введіть значення {i+1} елемента масиву: ")))
sum = 0
for i in range(n):
    if arr[i] % 2 != 0 and arr[i] % 3 != 0 and arr[i] % 5 != 0:
        sum += i
print("Сума індексів елементів, значення яких є простими числами:", sum)